; domain
(define (domain blocksworld-domain)
 (:requirements :strips :typing :constraints :action-costs)
 (:types block)
 (:predicates (clear ?obj - block) (ontable ?obj - block) (handempty) (holding ?obj - block) (on ?obj1 - block ?obj2 - block))
 (:functions (total-cost))
 (:action pickup
  :parameters ( ?obj - block)
  :precondition (and (clear ?obj) (ontable ?obj) (handempty))
  :effect (and (holding ?obj) (not (clear ?obj)) (not (ontable ?obj)) (not (handempty)) (increase (total-cost) 1)))
 (:action putdown
  :parameters ( ?obj - block)
  :precondition (and (holding ?obj))
  :effect (and (clear ?obj) (handempty) (ontable ?obj) (not (holding ?obj)) (increase (total-cost) 1)))
 (:action stack
  :parameters ( ?obj - block ?underobj - block)
  :precondition (and (clear ?underobj) (holding ?obj))
  :effect (and (handempty) (clear ?obj) (on ?obj ?underobj) (not (clear ?underobj)) (not (holding ?obj)) (increase (total-cost) 1)))
 (:action unstack
  :parameters ( ?obj - block ?underobj - block)
  :precondition (and (on ?obj ?underobj) (clear ?obj) (handempty))
  :effect (and (holding ?obj) (clear ?underobj) (not (on ?obj ?underobj)) (not (clear ?obj)) (not (handempty)) (increase (total-cost) 1)))
)

; problem
(define (problem blocksworld-problem)
 (:domain blocksworld-domain)
 (:objects
   purple_block_1 red_block_1 purple_block_2 grey_block_1 purple_block_3 brown_block_1 white_block_1 - block
 )
 (:init (ontable purple_block_1) (on red_block_1 purple_block_1) (on purple_block_2 red_block_1) (ontable grey_block_1) (ontable purple_block_3) (on brown_block_1 purple_block_3) (on white_block_1 grey_block_1) (clear purple_block_2) (clear brown_block_1) (clear white_block_1) (handempty) (= (total-cost) 0))
 (:goal (and (ontable brown_block_1)))
 (:constraints (sometime (not (clear brown_block_1))) (sometime-before (not (clear brown_block_1)) (or (not (ontable purple_block_3)) (not (ontable grey_block_1)))) (sometime (not (clear purple_block_1))) (sometime-after (not (clear purple_block_1)) (holding white_block_1)) (sometime (not (ontable white_block_1))) (sometime-after (not (ontable white_block_1)) (or (holding purple_block_1) (not (ontable brown_block_1)))) (sometime (not (on red_block_1 red_block_1))) (sometime-after (not (on red_block_1 red_block_1)) (on grey_block_1 white_block_1)) (sometime (clear purple_block_3)) (sometime-before (clear purple_block_3) (holding grey_block_1)))
 (:metric minimize (total-cost))
)

; plan
1. (unstack purple_block_2 red_block_1)
   deleted: (on purple_block_2 red_block_1) (clear purple_block_2) (handempty)
   added: (holding purple_block_2) (clear red_block_1)
   goals met: 0 of 1
2. (putdown purple_block_2)
   deleted: (holding purple_block_2)
   added: (clear purple_block_2) (handempty) (ontable purple_block_2)
   goals met: 0 of 1
3. (unstack red_block_1 purple_block_1)
   deleted: (on red_block_1 purple_block_1) (clear red_block_1) (handempty)
   added: (holding red_block_1) (clear purple_block_1)
   goals met: 0 of 1
4. (putdown red_block_1)
   deleted: (holding red_block_1)
   added: (clear red_block_1) (handempty) (ontable red_block_1)
   goals met: 0 of 1
5. (unstack white_block_1 grey_block_1)
   deleted: (on white_block_1 grey_block_1) (clear white_block_1) (handempty)
   added: (holding white_block_1) (clear grey_block_1)
   goals met: 0 of 1
6. (putdown white_block_1)
   deleted: (holding white_block_1)
   added: (clear white_block_1) (handempty) (ontable white_block_1)
   goals met: 0 of 1
7. (pickup grey_block_1)
   deleted: (clear grey_block_1) (ontable grey_block_1) (handempty)
   added: (holding grey_block_1)
   goals met: 0 of 1
8. (stack grey_block_1 white_block_1)
   deleted: (clear white_block_1) (holding grey_block_1)
   added: (handempty) (clear grey_block_1) (on grey_block_1 white_block_1)
   goals met: 0 of 1
9. (unstack brown_block_1 purple_block_3)
   deleted: (on brown_block_1 purple_block_3) (clear brown_block_1) (handempty)
   added: (holding brown_block_1) (clear purple_block_3)
   goals met: 0 of 1
10. (putdown brown_block_1)
   deleted: (holding brown_block_1)
   added: (clear brown_block_1) (handempty) (ontable brown_block_1)
   goals met: 1 of 1
